wrk2/results/no_istio_20251230_154433/wrk_logs/wrk_400rps_rep2.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 124.729ms, rate sampling interval: 718ms
  Thread calibration: mean lat.: 128.659ms, rate sampling interval: 750ms
  Thread calibration: mean lat.: 127.984ms, rate sampling interval: 740ms
  Thread calibration: mean lat.: 130.104ms, rate sampling interval: 738ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   163.98ms  230.65ms   1.04s    86.79%
    Req/Sec    98.86     14.22   133.00     76.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   61.63ms
 75.000%  252.29ms
 90.000%  456.19ms
 99.000%    1.04s 
 99.900%    1.65s 
 99.990%    2.07s 
 99.999%    2.17s 
100.000%    2.17s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.722     0.000000            1         1.00
       1.917     0.100000         1988         1.11
       2.945     0.200000         3971         1.25
       5.527     0.300000         5957         1.43
      10.415     0.400000         7941         1.67
      61.631     0.500000         9926         2.00
     109.567     0.550000        10921         2.22
     138.367     0.600000        11912         2.50
     172.159     0.650000        12909         2.86
     208.767     0.700000        13897         3.33
     252.287     0.750000        14889         4.00
     276.223     0.775000        15387         4.44
     304.383     0.800000        15892         5.00
     334.591     0.825000        16380         5.71
     367.871     0.850000        16876         6.67
     406.783     0.875000        17374         8.00
     427.775     0.887500        17620         8.89
     456.191     0.900000        17867        10.00
     483.839     0.912500        18116        11.43
     513.023     0.925000        18364        13.33
     549.375     0.937500        18612        16.00
     571.903     0.943750        18736        17.78
     603.135     0.950000        18860        20.00
     636.415     0.956250        18985        22.86
     684.543     0.962500        19109        26.67
     723.455     0.968750        19232        32.00
     756.223     0.971875        19294        35.56
     787.967     0.975000        19356        40.00
     827.903     0.978125        19418        45.71
     869.887     0.981250        19480        53.33
     920.575     0.984375        19542        64.00
     947.711     0.985938        19573        71.11
     976.895     0.987500        19604        80.00
    1021.951     0.989062        19635        91.43
    1067.007     0.990625        19666       106.67
    1120.255     0.992188        19697       128.00
    1160.191     0.992969        19714       142.22
    1195.007     0.993750        19728       160.00
    1221.631     0.994531        19744       182.86
    1261.567     0.995313        19759       213.33
    1298.431     0.996094        19775       256.00
    1342.463     0.996484        19783       284.44
    1360.895     0.996875        19790       320.00
    1392.639     0.997266        19798       365.71
    1449.983     0.997656        19806       426.67
    1499.135     0.998047        19814       512.00
    1524.735     0.998242        19818       568.89
    1534.975     0.998437        19821       640.00
    1556.479     0.998633        19825       731.43
    1602.559     0.998828        19829       853.33
    1665.023     0.999023        19833      1024.00
    1708.031     0.999121        19835      1137.78
    1721.343     0.999219        19837      1280.00
    1763.327     0.999316        19839      1462.86
    1809.407     0.999414        19841      1706.67
    1815.551     0.999512        19843      2048.00
    1832.959     0.999561        19844      2275.56
    1878.015     0.999609        19845      2560.00
    1882.111     0.999658        19846      2925.71
    1897.471     0.999707        19847      3413.33
    1959.935     0.999756        19848      4096.00
    1959.935     0.999780        19848      4551.11
    2014.207     0.999805        19849      5120.00
    2014.207     0.999829        19849      5851.43
    2073.599     0.999854        19850      6826.67
    2073.599     0.999878        19850      8192.00
    2073.599     0.999890        19850      9102.22
    2096.127     0.999902        19851     10240.00
    2096.127     0.999915        19851     11702.86
    2096.127     0.999927        19851     13653.33
    2096.127     0.999939        19851     16384.00
    2096.127     0.999945        19851     18204.44
    2174.975     0.999951        19852     20480.00
    2174.975     1.000000        19852          inf
#[Mean    =      163.983, StdDeviation   =      230.649]
#[Max     =     2172.928, Total count    =        19852]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  23818 requests in 1.00m, 7.83MB read
Requests/sec:    396.87  
Transfer/sec:    133.56KB