wrk2/results/no_istio_20251230_154433/wrk_logs/wrk_600rps_rep1.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 498.608ms, rate sampling interval: 2500ms
  Thread calibration: mean lat.: 435.128ms, rate sampling interval: 2119ms
  Thread calibration: mean lat.: 462.673ms, rate sampling interval: 2424ms
  Thread calibration: mean lat.: 502.404ms, rate sampling interval: 2656ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.26s     2.01s    8.95s    75.34%
    Req/Sec   140.34     15.59   169.00     73.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.76s 
 75.000%    3.11s 
 90.000%    5.05s 
 99.000%    8.95s 
 99.900%   10.96s 
 99.990%   14.32s 
 99.999%   14.67s 
100.000%   14.67s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.787     0.000000            1         1.00
     216.831     0.100000         2809         1.11
     602.623     0.200000         5616         1.25
     966.655     0.300000         8422         1.43
    1333.247     0.400000        11239         1.67
    1755.135     0.500000        14039         2.00
    1980.415     0.550000        15441         2.22
    2226.175     0.600000        16857         2.50
    2488.319     0.650000        18257         2.86
    2772.991     0.700000        19660         3.33
    3110.911     0.750000        21061         4.00
    3317.759     0.775000        21758         4.44
    3545.087     0.800000        22459         5.00
    3819.519     0.825000        23162         5.71
    4128.767     0.850000        23869         6.67
    4526.079     0.875000        24572         8.00
    4751.359     0.887500        24917         8.89
    5050.367     0.900000        25266        10.00
    5345.279     0.912500        25622        11.43
    5722.111     0.925000        25971        13.33
    6103.039     0.937500        26319        16.00
    6352.895     0.943750        26495        17.78
    6598.655     0.950000        26671        20.00
    6823.935     0.956250        26848        22.86
    7098.367     0.962500        27023        26.67
    7340.031     0.968750        27196        32.00
    7487.487     0.971875        27284        35.56
    7667.711     0.975000        27373        40.00
    7835.647     0.978125        27461        45.71
    8044.543     0.981250        27548        53.33
    8294.399     0.984375        27635        64.00
    8437.759     0.985938        27680        71.11
    8634.367     0.987500        27723        80.00
    8847.359     0.989062        27766        91.43
    9027.583     0.990625        27811       106.67
    9224.191     0.992188        27854       128.00
    9347.071     0.992969        27876       142.22
    9560.063     0.993750        27898       160.00
    9699.327     0.994531        27921       182.86
    9789.439     0.995313        27942       213.33
    9969.663     0.996094        27964       256.00
   10035.199     0.996484        27975       284.44
   10117.119     0.996875        27986       320.00
   10215.423     0.997266        27997       365.71
   10256.383     0.997656        28008       426.67
   10469.375     0.998047        28019       512.00
   10600.447     0.998242        28024       568.89
   10649.599     0.998437        28030       640.00
   10764.287     0.998633        28035       731.43
   10838.015     0.998828        28041       853.33
   10985.471     0.999023        28046      1024.00
   11059.199     0.999121        28049      1137.78
   11444.223     0.999219        28052      1280.00
   11714.559     0.999316        28054      1462.86
   12148.735     0.999414        28057      1706.67
   13049.855     0.999512        28060      2048.00
   13058.047     0.999561        28061      2275.56
   13197.311     0.999609        28063      2560.00
   13688.831     0.999658        28064      2925.71
   13983.743     0.999707        28065      3413.33
   14114.815     0.999756        28068      4096.00
   14114.815     0.999780        28068      4551.11
   14114.815     0.999805        28068      5120.00
   14311.423     0.999829        28069      5851.43
   14311.423     0.999854        28069      6826.67
   14319.615     0.999878        28070      8192.00
   14319.615     0.999890        28070      9102.22
   14548.991     0.999902        28072     10240.00
   14548.991     0.999915        28072     11702.86
   14548.991     0.999927        28072     13653.33
   14548.991     0.999939        28072     16384.00
   14548.991     0.999945        28072     18204.44
   14548.991     0.999951        28072     20480.00
   14548.991     0.999957        28072     23405.71
   14548.991     0.999963        28072     27306.67
   14671.871     0.999969        28073     32768.00
   14671.871     1.000000        28073          inf
#[Mean    =     2260.361, StdDeviation   =     2014.301]
#[Max     =    14663.680, Total count    =        28073]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  33528 requests in 1.00m, 11.14MB read
Requests/sec:    558.59  
Transfer/sec:    190.06KB