wrk2/results/no_istio_20251230_154433/wrk_logs/wrk_600rps_rep2.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 422.785ms, rate sampling interval: 1938ms
  Thread calibration: mean lat.: 607.350ms, rate sampling interval: 3282ms
  Thread calibration: mean lat.: 462.352ms, rate sampling interval: 2203ms
  Thread calibration: mean lat.: 555.685ms, rate sampling interval: 2660ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.48s     2.34s   10.01s    75.92%
    Req/Sec   139.35     15.46   169.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.80s 
 75.000%    3.59s 
 90.000%    5.82s 
 99.000%   10.01s 
 99.900%   12.25s 
 99.990%   12.96s 
 99.999%   13.02s 
100.000%   13.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.716     0.000000            1         1.00
     150.783     0.100000         2799         1.11
     521.215     0.200000         5599         1.25
     895.999     0.300000         8399         1.43
    1304.575     0.400000        11196         1.67
    1798.143     0.500000        13995         2.00
    2103.295     0.550000        15399         2.22
    2424.831     0.600000        16797         2.50
    2772.991     0.650000        18201         2.86
    3153.919     0.700000        19595         3.33
    3594.239     0.750000        20995         4.00
    3844.095     0.775000        21692         4.44
    4085.759     0.800000        22397         5.00
    4349.951     0.825000        23093         5.71
    4710.399     0.850000        23791         6.67
    5189.631     0.875000        24491         8.00
    5451.775     0.887500        24843         8.89
    5824.511     0.900000        25193        10.00
    6156.287     0.912500        25541        11.43
    6664.191     0.925000        25891        13.33
    7110.655     0.937500        26242        16.00
    7393.279     0.943750        26416        17.78
    7602.175     0.950000        26591        20.00
    7827.455     0.956250        26766        22.86
    8114.175     0.962500        26943        26.67
    8421.375     0.968750        27120        32.00
    8544.255     0.971875        27208        35.56
    8724.479     0.975000        27292        40.00
    8921.087     0.978125        27378        45.71
    9175.039     0.981250        27467        53.33
    9445.375     0.984375        27553        64.00
    9609.215     0.985938        27596        71.11
    9773.055     0.987500        27640        80.00
    9928.703     0.989062        27684        91.43
   10067.967     0.990625        27731       106.67
   10272.767     0.992188        27774       128.00
   10371.071     0.992969        27794       142.22
   10485.759     0.993750        27816       160.00
   10559.487     0.994531        27836       182.86
   10665.983     0.995313        27860       213.33
   10829.823     0.996094        27880       256.00
   10944.511     0.996484        27891       284.44
   11100.159     0.996875        27903       320.00
   11370.495     0.997266        27913       365.71
   11714.559     0.997656        27924       426.67
   11870.207     0.998047        27935       512.00
   11976.703     0.998242        27941       568.89
   12050.431     0.998437        27946       640.00
   12189.695     0.998633        27951       731.43
   12230.655     0.998828        27958       853.33
   12247.039     0.999023        27962      1024.00
   12263.423     0.999121        27965      1137.78
   12320.767     0.999219        27969      1280.00
   12410.879     0.999316        27970      1462.86
   12500.991     0.999414        27973      1706.67
   12632.063     0.999512        27977      2048.00
   12632.063     0.999561        27977      2275.56
   12697.599     0.999609        27979      2560.00
   12705.791     0.999658        27980      2925.71
   12722.175     0.999707        27981      3413.33
   12910.591     0.999756        27983      4096.00
   12910.591     0.999780        27983      4551.11
   12926.975     0.999805        27984      5120.00
   12951.551     0.999829        27985      5851.43
   12951.551     0.999854        27985      6826.67
   12959.743     0.999878        27987      8192.00
   12959.743     0.999890        27987      9102.22
   12959.743     0.999902        27987     10240.00
   12959.743     0.999915        27987     11702.86
   12959.743     0.999927        27987     13653.33
   12992.511     0.999939        27988     16384.00
   12992.511     0.999945        27988     18204.44
   12992.511     0.999951        27988     20480.00
   12992.511     0.999957        27988     23405.71
   12992.511     0.999963        27988     27306.67
   13017.087     0.999969        27989     32768.00
   13017.087     1.000000        27989          inf
#[Mean    =     2483.164, StdDeviation   =     2342.494]
#[Max     =    13008.896, Total count    =        27989]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  33321 requests in 1.00m, 11.04MB read
Requests/sec:    555.27  
Transfer/sec:    188.32KB